GitConverter/src/Catalogs/ХранилищаКонфигураций/ХранилищаКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищаКонфигураций</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогВыгрузкиВерсий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияВGit</name>
    <type>
      <types>CatalogRef.ВерсииХранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛокальныйКаталогGit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьВременныеДанныеВерсииПослеКоммита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРепозиторияGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСервераGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСервераGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьКоммиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоПодготавливаемыхВерсий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоМетаданных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьВсеОчереди</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИспользованиеОбщихОчередей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоммитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПомещатьАнонимноЕслиНеНайденПользователь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПроектаEDT</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьКонфигурацииПоставщиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертироватьВФорматEDT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьМеткиСВерсиейКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияEDT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьЛогирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХранилища</name>
    <type>
      <types>EnumRef.ТипыХранилищаКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйПроект</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПроектаEDT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяCLI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияEDTCLI</name>
    <type>
      <types>CatalogRef.ВерсииEDT</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогДляАрхивацииОшибок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьКоммитыВРепозиторийGit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозниклаОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРасписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

GitConverter/src/Catalogs/ХранилищаКонфигураций/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИБ

Процедура ЗаполнитьПредставленияРасписаний() Экспорт
	Выборка = Выбрать();
	Пока Выборка.Следующий() Цикл
		Выборка.Ссылка.ПолучитьОбъект().Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

// Возвращает запрос по справочнику по указанному отборы и параметрам.
Функция ЗапросПоЭлементам(Отбор, ПоляУпорядочивания = "", КоличествоПервых = 0) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Таблица.Ссылка КАК Ссылка,
	|	Таблица.ПометкаУдаления КАК ПометкаУдаления,
	|	Таблица.Наименование КАК Наименование,
	|	Таблица.Адрес КАК Адрес,
	|	Таблица.АдресРепозиторияGit КАК АдресРепозиторияGit,
	|	Таблица.ВерсияВGit КАК ВерсияВGit,
	|	Таблица.ВерсияПлатформыХранилища КАК ВерсияПлатформыХранилища,
	|	Таблица.ВыгружатьИзменения КАК ВыгружатьИзменения,
	|	Таблица.ВыполнятьКоммиты КАК ВыполнятьКоммиты,
	|	Таблица.ЗапретитьИспользованиеОбщихОчередей КАК ЗапретитьИспользованиеОбщихОчередей,
	|	Таблица.ИмяВетки КАК ИмяВетки,
	|	Таблица.ИмяПользователяХранилища КАК ИмяПользователяХранилища,
	|	Таблица.КаталогВыгрузкиВерсий КАК КаталогВыгрузкиВерсий,
	|	Таблица.ИмяПроектаEDT КАК ИмяПроектаEDT,
	|	Таблица.КаталогДляАрхивацииОшибок КАК КаталогДляАрхивацииОшибок,
	|	Таблица.КоличествоКоммитов КАК КоличествоКоммитов,
	|	Таблица.ЛокальныйКаталогGit КАК ЛокальныйКаталогGit,
	|	Таблица.МаксимальноеКоличествоПодготавливаемыхВерсий КАК МаксимальноеКоличествоПодготавливаемыхВерсий,
	|	Таблица.МинимальноеКоличествоМетаданных КАК МинимальноеКоличествоМетаданных,
	|	Таблица.ОбрабатыватьВсеОчереди КАК ОбрабатыватьВсеОчереди,
	|	Таблица.Описание КАК Описание,
	|	Таблица.ОтправлятьКоммитыВРепозиторийGit КАК ОтправлятьКоммитыВРепозиторийGit,
	|	Таблица.ПарольПользователяХранилища КАК ПарольПользователяХранилища,
	|	Таблица.ПарольСервераGit КАК ПарольСервераGit,
	|	Таблица.ПерваяВерсия КАК ПерваяВерсия,
	|	Таблица.ПользовательСервераGit КАК ПользовательСервераGit,
	|	Таблица.ПоследняяВерсия КАК ПоследняяВерсия,
	|	Таблица.РазрешитьПомещатьАнонимноЕслиНеНайденПользователь КАК РазрешитьПомещатьАнонимноЕслиНеНайденПользователь,
	|	Таблица.ИдентификаторЗадания КАК ИдентификаторЗадания,
	|	Таблица.УдалятьВременныеДанныеВерсииПослеКоммита КАК УдалятьВременныеДанныеВерсииПослеКоммита,
	|	Таблица.УдалятьКонфигурацииПоставщиков КАК УдалятьКонфигурацииПоставщиков,
	|	Таблица.ВерсияВGit.Код КАК КодВерсииВGit,
	|	Таблица.ВозниклаОшибка КАК ВозниклаОшибка,
	|	Таблица.КоличествоОшибок КАК КоличествоОшибок
	|ИЗ
	|	Справочник.ХранилищаКонфигураций КАК Таблица";
	
	Если КоличествоПервых > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоПервых, "ЧГ="));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1000", "ВЫБРАТЬ");
	КонецЕсли;
	
	// Отборы.
	ФрагментыУсловий = Новый Массив;
	Для Каждого КлючИЗначение Из Отбор Цикл
		ИмяРеквизита = КлючИЗначение.Ключ;
		ЗначениеОтбора = КлючИЗначение.Значение;
		// Фиксированный массив преобразуем в обычный.
		Если ТипЗнч(ЗначениеОтбора) = Тип("ФиксированныйМассив") Тогда
			ЗначениеОтбора = Новый Массив(ЗначениеОтбора);
		КонецЕсли;
		Запрос.УстановитьПараметр(ИмяРеквизита, ЗначениеОтбора);
		Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
			ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 В (&%1)", ИмяРеквизита))
		Иначе
			ФрагментыУсловий.Добавить(СтрШаблон("Таблица.%1 = &%1", ИмяРеквизита))
		КонецЕсли;
	КонецЦикла;
	Если ФрагментыУсловий.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	" + СтрСоединить(ФрагментыУсловий, Символы.ПС + Символы.Таб + Символы.Таб + "И ");
	КонецЕсли;
	
	// Порядок.
	Если ЗначениеЗаполнено(ПоляУпорядочивания) Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	" + ПоляУпорядочивания;
	КонецЕсли;
	
	Возврат Запрос;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьПараметрыХранилища(ПараметрыХранилища) Экспорт
	ПараметрыХранилища.КаталогВыгрузкиВерсий = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПараметрыХранилища.КаталогВыгрузкиВерсий);
	
	Если ТипЗнч(ПараметрыХранилища.КодВерсииВGit) <> Тип("Число") Тогда
		ПараметрыХранилища.КодВерсииВGit = 0;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////
	// Каталоги локального репозитория Git.
	
	// Путь к папке репозитория Git: "</path_to_git>/".
	ЛокальныйКаталогGit = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПараметрыХранилища.ЛокальныйКаталогGit);
	
	// Путь к папке проекта в репозитории Git: "<ProjectName>/".
	ОтносительноеИмяКаталогаПроектаEDT = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПараметрыХранилища.ИмяПроектаEDT);
	
	// Путь к проекту в репозитории: "</path_to_git>/<ProjectName>/.
	ПараметрыХранилища.Вставить("РепозиторийGit_ПутьКПроектуEDT", ЛокальныйКаталогGit + ОтносительноеИмяКаталогаПроектаEDT);
	
	// Путь к папке src в репозитории Git: "<ProjectName>/src/".
	ОтносительноеИмяКаталогаИсходниковEDT = ОтносительноеИмяКаталогаПроектаEDT + "src";
	ОтносительноеИмяКаталогаИсходниковEDT = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ОтносительноеИмяКаталогаИсходниковEDT);
	
	// Путь к файлам конфигурации проекта в репозитории: "</path_to_git>/<ProjectName>/src/.
	ПараметрыХранилища.Вставить("РепозиторийGit_ПутьКИсходникамEDT", ЛокальныйКаталогGit + ОтносительноеИмяКаталогаИсходниковEDT);
	
	////////////////////////////////////////////////////////////////////////////////
	// Константы.
	
	ПараметрыХранилища.Вставить("МаксимальноеКоличествоИнкрементальныхВерсийПодряд", Константы.МаксимальноеКоличествоИнкрементальныхВерсийПодряд.Получить());
	Если ПараметрыХранилища.МаксимальноеКоличествоИнкрементальныхВерсийПодряд < 1 Тогда
		ПараметрыХранилища.МаксимальноеКоличествоИнкрементальныхВерсийПодряд = 10;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
